Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: You may have to re-read this entire section a few times...
es_es: Es posible que tenga que leer esta sección varias veces...

source: Note that the C<%a> and C<%b>, the short forms of the day of the week and the month of the year, may not necessarily be three characters wide.
es_es: Note que C<%a> y C<%b>, las formas cortas del día de la semana y el mes del año, pueden no ser necesariamente de tres caracteres de ancho.

source: Systems like Unix, Mac OS, and Plan 9, that end lines with a single character and encode that character in C as C<"\n"> do not need C<binmode>.
es_es: Los sistemas como Unix, Mac OS, y Plan 9, cuyos finales de línea terminan con un único carácter y codifican ese carácter en C como C<"\n"> no necesitan C<binmode>.

source: The operator will have the same precedence and associativity as C<||>.
es_es: El operador tendrá la misma precedencia y asociatividad que C<||>.

source: Sets the current position for the C<readdir> routine on DIRHANDLE.
es_es: Establece la posición actual de la rutina C<readdir> en IDENTIFICADOR_DIR.

source: String literals are usually delimited by either single or double quotes.
es_es: Los literales de cadena se suelen delimitar con comillas simples o dobles.

source: r Return substitution and leave the original string untouched.
es_es: r Devuelve la sustitución y deja la cadena original intacta.

source: In scalar context, returns the number of times the expression was true.
es_es: En contexto escalar, devuelve el número de veces que la expresión fue verdadera.

source: LABEL for (EXPR; EXPR; EXPR) BLOCK
es_es: ETIQUETA for (EXPR; EXPR; EXPR) BLOQUE

source: is made equivalent to
es_es: es equivalente a

source: The defined test avoids problems where line has a string value that would be treated as false by Perl, for example a "" or a "0" with no trailing newline.
es_es: La prueba de definición evita problemas donde la línea contiene un valor de cadena que sería tratado como falso por Perl, como por ejemplo, un "" o un "0" sin salto de línea final.

source: join() could return garbage when the same join() statement was used to process 8 bit data having earlier processed UTF8 data, due to the flags on that statement's temporary workspace not being reset correctly.
es_es: join() podría devolver basura cuando la misma instrucción join() fue anteriormente usada para procesar datos de 8 bits habiendo procesado anteriormente datos UTF8, debido a que las banderas en ese área de trabajo temporal no eran correctamente reinicializadas.

source: A new operator, C<...>, nicknamed the Yada Yada operator, has been added.
es_es: Un nuevo operador, C<...>, apodado el operador Blablablá, ha sido añadido.

source: C<default> behaves exactly like C<when(1 == 1)>, which is to say that it always matches.
es_es: C<default> se comporta exactamente igual que C<when(1 == 1)>, que es lo mismo que decir que siempre coincide.

source: See L<perlfunc/sort> for examples of how to arrange for an output ordering.
es_es: Ver L<perlfunc/sort> para ejemplos de cómo organizar una salida ordenada.

source: S<[ B<-cw> ] [ B<-d>[B<t>][:I<debugger>] ] [ B<-D>[I<number/list>] ]>
es_es: S<[ B<-cw> ] [ B<-d>[B<t>][:I<debugger>] ] [ B<-D>[I<número/lista>] ]>

source: 10 ctime just use @INC include paths
es_es: 10 ctime ¡use @INC rutas de inclusión

source: If either operand of scalar ".." is a constant expression, that operand is considered true if it is equal (C<==>) to the current input line number (the C<$.> variable).
es_es: Si alguno de los operandos del escalar ".." es una expresión constante, este operando es considerado cierto si es igual (C<==>) al número de línea actual de la entrada (la variable C<$.>).

source: If you're confused about why you use an '@' there on a hash slice instead of a '%', think of it like this.
es_es: Si se siente confuso sobre el porqué usa un '@' en una porción de hash en lugar de un '%', piénselo así:

source: On failure, it returns false and sets C<$!> (errno):
es_es: En caso de error, se devuelve falso y establece C<$!> (errno):

source: (These used to live in t/op).
es_es: (antes estaban en t/op).

source: This is subroutine definition, not a real function I<per se>.
es_es: Esta es la definición de subrutina, no una función real I<per se>.

source: printf '<%.1g>', 100; # prints "<1e+02>"
es_es: printf '<%.1g>', 100; # imprime "<1e+02>"

source: =head1 Obituary
es_es: =head1 Obituario

source: See C<sprintf> for an explanation of the format argument.
es_es: Vea C<sprintf> para una explicación del argumento de formato.

source: undef Any undefined !defined($b)
es_es: undef Cualquiera indefinido !defined($b)

source: Here are some concerns to keep in mind when using an endianness modifier:
es_es: Éstas son algunas de las preocupaciones a tener en cuenta cuando se usa un modificador de ordenación:

source: In addition, a lot of the quite clunky routines like fsqrt() and flog() are now much much faster.
es_es: Además, muchas de las rutinas bastante torpes como fsqrt() y flog() son ahora mucho más rápidas.

source: (If a curly bracket occurs in any other context and does not form part of a backslashed sequence like C<\x{...}>, it is treated as a regular character.
es_es: (Si aparece una llave en cualquier otro contexto y no forma parte de una secuencia escapada como en C<\x{...}>, es tratada como un carácter normal.

source: When complementing strings, if all characters have ordinal values under 256, then their complements will, also.
es_es: Al complementar las cadenas, si todos los caracteres tienen valores ordinales menores de 256, sus complementarios, también lo serán.

source: if (%tied_hash) {
es_es: if (%hash_enlazado) {

source: If the final match did indeed match C<p>, it's a good bet that you're running a very old (pre-5.6.0) version of Perl.
es_es: Si la última coincidencia, es, en su lugar, C<p>, es una buena apuesta de que está ejecutando una versión anterior de Perl (pre-5.6.0).

source: In list context, this isn't important because you automatically get them all anyway.
es_es: En contexto de lista, esto no es importante, ya que, de todos modos, los obtiene automáticamente.

source: printf '<%06s>', 12; # prints "<000012>"
es_es: printf '<%06s>', 12; # imprime "<000012>"

source: There are still some bits and pieces hanging around in here that need to be moved.
es_es: Aún quedan cosas que deben moverse a otra parte.

source: ISBN: 1-55860-701-3 [1st edition March 2005]
es_es: ISBN: 1-55860-701-3 [1ª edición - Marzo de 2005]

source: make perl fork() safe even on platforms that don't have pthread_atfork()
es_es: hacer que el fork() de perl sea seguro incluso en plataformas que no tienen pthread_atfork()

source: These news matter to you only if you either write XS code or like to know about or hack Perl internals (using Devel::Peek or any of the C<B::> modules counts), or like to run Perl with the C<-D> option.
es_es: Estas noticias solamente son importantes para usted si, o escribe código XS o le gustaría saber acerca de o quiere I<hackear> las partes internas Perl (usando Devel::Peek o cualquiera de los módulos C<B::>), o como para ejecutar Perl con la opción C<-D>.

source: Tied hashes do not currently return anything useful in scalar context, for example when used as boolean tests:
es_es: Actualmente, los hashes enlazados no devuelven nada útil en contexto escalar, por ejemplo cuando se utilizan como pruebas booleanas:

source: If you want to test whether you can write, either use file tests or try setting a dummy hash entry inside an C<eval> to trap the error.
es_es: Si quiere comprobar si puede escribir o no, use test de archivo o intente asignar una entrada hash ficticia dentro de un C<eval>, para atrapar el error.

source: This has been added to the core (version 2.020).
es_es: Fue añadido al núcleo principal (versión 2.020).

source: # These evaluate exit before doing the print:
es_es: # Evalúan exit antes de hacer el print:

source: And still another case is that you may want to call C<srand()> after a C<fork()> to avoid child processes sharing the same seed value as the parent (and consequently each other).
es_es: Y otro caso es que puede llamar a C<srand()> después de un C<fork()> para evitar que los procesos hijos compartan el mismo valor de inicialización como el padre (y por lo tanto entre sí).

source: to generate a suitable uconfig.h
es_es: para generar un uconfig.h adecuado.

source: In other words, once the C<(*COMMIT)> has been entered, and if the pattern does not match, the regex engine will not try any further matching on the rest of the string.
es_es: En otras palabras, una vez que encontramos C<(*COMMIT)>, y si el patrón no coincide, el motor de expresiones regulares no tratará de encontrar nada más en el resto de la cadena.

source: Documentation improved
es_es: Mejor documentación

source: That is what happens at the end of execution: Perl destroys all data structures, including user data.
es_es: Eso es lo que ocurre al final de la ejecución: Perl destruye todas las estructuras de datos, incluyendo los datos del usuario.

source: @files = glob("$dir/*.[ch]");
es_es: @archivos = glob("$dir/*.[ch]");

source: =head2 Where can I buy a commercial version of perl?
es_es: =head2 ¿Dónde puedo adquirir una versión comercial de perl?

source: Evaluates EXPR and exits immediately with that value.
es_es: Evalúa EXPR y sale inmediatamente con este valor.

source: You should also always run under C<use strict> or know the reason why not.
es_es: Debería siempre también correr con C<use strict> o conocer la razón de porqué no hacerlo.

source: In fact, it isn't a goto in the normal sense at all, and doesn't have the stigma associated with other gotos.
es_es: De hecho, no es un goto en el sentido normal y no tiene el estigma asociado con los otros gotos.

source: If you get complaints about so_locations then search in the file hints/irix_6.sh for "lddflags" and do the suggested adjustments.
es_es: Si recibe problemas sobre so_locations entonces busque en el archivo hints/irix_6.sh por "lddflags" y haga los ajustes sugeridos.

source: Note that, as in perl 5.10.0, C<when (1..10)> will not work to test whether a given value is an integer between 1 and 10; you should use C<when ([1..10])> instead (note the array reference).
es_es: Tenga en cuenta que, como en Perl 5.10.0, C<when (1..10)> no va servirá para probar si un valor es un número entero entre 1 y 10, así que en su lugar debería usar C<when ([1..10])> (nótese la referencia al array).

source: # This is the UTF-8 encoding of the string in the previous example
es_es: # Esta es la codificación UTF-8 de la cadena del ejemplo anterior

source: The general rule is that the identifier must be a string literal.
es_es: La regla general es que el identificador debe ser una cadena literal.

source: perlref Perl references, the rest of the story
es_es: perlref Referencias: el resto de la historia

source: We recommend that you use void context C<keys @array> for this, but reasoned that it taking C<values @array> out would require more documentation than leaving it in.)
es_es: Le recomendamos que utilice el contexto vacío C<keys @array> para esto, pero razonando que hacer C<values @array> exigirá más comentarios que dejarlo tal cual)

source: On Windows Borland's C compiler can now compile perl with PerlIO and/or USE_LARGE_FILES enabled.
es_es: El compilador de Borland C en Windows ahora puede compilar perl con PerlIO y/o tener activado USE_LARGE_FILES.

source: =head2 New "Tied variable freed while still in use"
es_es: =head2 Nuevo "I<Tied variable freed while still in use>" (Variable enlazada liberada mientras todavía está en uso)

source: Does not automatically flush output handles on some platforms.
es_es: En algunas plataformas no se realiza un vaciado de los identificadores de archivo de salida.

source: The use of a camel with the topic of Perl is a trademark of O'Reilly and Associates Inc., and is used with their permission (ie distribution of the source, compiling a Windows executable from it, and using that executable locally).
es_es: El uso de un camello con el motivo de Perl es una marca registrada de O'Reilly and Associates Inc., y es utilizado con su permiso (es decir, la distribución del código fuente, la compilación de un ejecutable en Windows a partir de él, y ​​el uso de ese ejecutable a nivel local).

source: Even if you aren't in doubt, consider the mental welfare of the person who has to maintain the code after you, and who will probably put parentheses in the wrong place.
es_es: Incluso si usted no tiene dudas, considerar el bienestar mental de la persona que tenga que mantener el código después de usted, y quien seguramente pondrá los paréntesis en el lugar equivocado.

source: For new projects the core perl team would strongly recommend that you use dedicated, single purpose security tools such as C<sudo> in preference to C<suidperl>.
es_es: Para nuevos proyectos el equipo básico de desarrollo perl recomienda, encarecidamente, que utilice herramientas específicas para el propósito de seguridad, tales como C<sudo>, en lugar de C<suidperl>.

source: For C<\Y|$re\Y|> the variable part of this regular expression needs to be converted explicitly (but only if the special meaning of C<\Y|> should be enabled inside $re):
es_es: Para C<\Y|$re\Y|> la parte variable de esta expresión regular es necesario convertirla de forma explícita (pero sólo si el significado especial de C<\Y|> debe estar habilitado en el interior de $re):

source: These constants are traditionally valued 1, 2, 8 and 4, but you can use the symbolic names if you import them from the L<Fcntl> module, either individually, or as a group using the C<:flock> tag.
es_es: Estas constantes tienen, tradicionalmente, los valores 1, 2, 8 y 4, pero puede usar los nombres simbólicos si los importa con el módulo L<Fcntl>, tanto de forma individual o como un grupo usando la marca C<:flock>.

source: X<scalar>
es_es: X<scalar> X<escalar>

source: you want the pattern to use the initial values of the variables regardless of whether they change or not.
es_es: desea que el patrón use los valores iniciales de las variables, independientemente de si van a cambiar o no.

source: ($sec,$min,$hour,$mday,$mon,$year,$wday,$yday,$isdst) = localtime(time);
es_es: ($seg,$min,$hora,$mdia,$mes,$anno,$sdia,$ydia,$esdst) = localtime(time);

source: } map { [$_, /=(\d+)/, uc($_)] } @old;
es_es: } map { [$_, /=(\d+)/, uc($_)] } @viejo;

source: S<[ B<-I>I<dir> ] [ B<-m>[B<->]I<module> ] [ B<-M>[B<->]I<'module...'> ] [ B<-f> ]>
es_es: S<[ B<-I>I<dir> ] [ B<-m>[B<->]I<módulo> ] [ B<-M>[B<->]I<'módulo...'> ] [ B<-f> ]>

source: is you, if you're thinking about copying or distributing this Package.
es_es: es usted, si usted está pensando en copiar o distribuir este paquete.

source: The user types in a password that is crypt()'d with the same salt as the stored digest.
es_es: El usuario escribe la contraseña que es en-crypt()-tada con el mismo salto con el que fue almacenado el I<digest>.

source: say "Oh look, an exception--whatever.";
es_es: say "¡Oh, mira!, una excepción lo-que-sea.";

source: =item substr EXPR,OFFSET
es_es: =item substr EXPR,DESPLAZAMIENTO

source: Absolute numbered groups were referred to using C<\1>, C<\2>, etc., and this notation is still accepted (and likely always will be).
es_es: Los grupos numerados de forma absoluta eran de la forma C<\1>, C<\2>, etc., y esta notación todavía está aceptada (y probablemente siempre lo será).

source: Otherwise, the string describing the equivalent prototype is returned.
es_es: De lo contrario, se devuelve la cadena que describe el prototipo equivalente.

source: by Lincoln Stein
es_es: Lincoln Stein

source: Weak reference deletion remains I<O(n)>, but if deletion only happens at program exit, it may be skipped completely.
es_es: El borrado de referencias débiles sigue siendo I<O(n)>, pero si el borrado solo sucede en la salida del programa, puede ser omitido por completo.

source: =item setsockopt SOCKET,LEVEL,OPTNAME,OPTVAL X<setsockopt>
es_es: =item setsockopt SOCKET,NIVEL,OPCIÓN_NOMBRE,OPCIÓN_VALOR X<setsockopt>

source: Capture groups contained by the pattern will have the value as determined by the outermost recursion.
es_es: Los grupos de captura que contengan el patrón tendrán el valor determinado por la recursividad más externa.

source: If any list operator (print(), etc.) or any unary operator (chdir(), etc.) is followed by a left parenthesis as the next token, the operator and arguments within parentheses are taken to be of highest precedence, just like a normal function call.
es_es: Si cualquier operador de lista (print(), etc) o cualquier otro operador unario (chdir(), etc) es seguido por un paréntesis de apertura como el siguiente token, el operador y los argumentos entre paréntesis se considera que son de mayor prioridad, como en una llamada a una función normal.

source: VERSION may be either a numeric argument such as 5.006, which will be compared to C<$]>, or a literal of the form v5.6.1, which will be compared to C<$^V> (aka $PERL_VERSION).
es_es: VERSIÓN puede ser un argumento numérico, como 5.006, que será comparado con C<$]>, o un literal de la forma v5.6.1, que será comparado con C<$^V> (alias de $PERL_VERSION).

source: If this is not the case; supposing it is, say telcoUTS, create a script, uts/uname (i.e. uname, in the subdirectory "uts" of the main Perl source dir):
es_es: Si este no es el caso, suponiendo que fuera, digamos telcoUTS, cree un script, uts/uname (es decir, uname en el subdirectorio "uts" del directorio principal de Perl):

source: Because we don't have special variable types, and Perl needs to know whether to sort numerically (where 99 is less than 100) or alphabetically (where 100 comes before 99).
es_es: Porque Perl no distingue el tipo del contenido de las variables y tiene que determinar si debe ordenar numéricamente (99 menor que 100) o alfabéticamente (100 es anterior a 99).

source: For WHENCE, you may also use the constants C<SEEK_SET>, C<SEEK_CUR>, and C<SEEK_END> (start of the file, current position, end of the file) from the Fcntl module.
es_es: Para DÓNDE puede usar las constantes C<SEEK_SET>, C<SEEK_CUR>, y C<SEEK_END> (inicio de archivo, posición actual, y fin de archivo) del módulo L<Fcntl>.

source: Because C<< <=> >> returns C<undef> when either operand is C<NaN> (not-a-number), and laso because C<sort> raises an exception unless the result of a comparison is defined, be careful when sorting with a comparison function like C<< $a <=> $b >> any lists that might contain a C<NaN>.
es_es: Dado que C<< <=> >> devuelve C<undef> cuando alguno de los operandos es C<NaN> (I<not-a-number>, no es un número), y porque también C<sort> lanza una excepción a menos que el resultado de la comparación esté definido, tenga cuidado al ordenar con una función de comparación como C<< $a <=> $b >> cualquier lista que pueda contener un C<NaN>.

source: No knowledge of XS is necessary.
es_es: Para ello no tiene que saber cómo funciona XS.

source: print "Password: ";
es_es: print "Contraseña: ";

source: An exception is raised if VERSION is greater than the version of the current Perl interpreter; Perl will not attempt to parse the rest of the file.
es_es: Se genera una excepción si la VERSIÓN es mayor que la versión del intérprete actual de Perl; Perl no tratará de analizar el resto del archivo.

source: All documentation of this version of Perl therefore refers to "layers" rather than to "disciplines".
es_es: Toda documentación desde esta versión de Perl se refiere a "capas" en vez de a "disciplinas".

source: On Cygwin we now strip the last number from the DLL.
es_es: En Cygwin ahora quitamos el último número de la DLL.

source: That's psychology....
es_es: Esa es la psicología...

source: This time only two filters have been used; we only need to manipulate the contents of the key, so it wasn't necessary to install any value filters.
es_es: En este caso no se han utilizado más que dos filtros; solo hay que manipular el contenido de la clave, por lo que no es necesario instalar ningún filtro de valores.

source: Typically, each converted value looks like its machine-level representation.
es_es: Normalmente, cada valor convertido se parece a su representación a nivel de máquina.

source: With certain HP C compiler releases (e.g. B.11.11.02) you will get many warnings like this (lines wrapped for easier reading):
es_es: Con ciertas versiones del compilador de C de HP (por ejemplo, B.11.11.02) obtendrá muchas advertencias como esta (líneas ajustadas para facilitar la lectura):

source: Match 0 or more times, not greedily
es_es: Coincide con 0 o más veces, sin avaricia

# $/ = " "; # put back to normal input delimiter
source: $/ = "\n"; # put back to normal input delimiter
es_es: $/ = "\n"; # volvemos al delimitador de entrada normal

source: Such use shall not be construed as a distribution of this Package.
es_es: Tal uso no debe interpretarse como una distribución de este Paquete.

source: See L<perlsec>.
es_es: Vea L<perlsec>.

source: 3 nlink number of (hard) links to the file
es_es: 3 nlink número de enlaces (duros) al archivo

source: Same as C<y///>.
es_es: Igual que el C<y///>.

source: This file contains instructions how to build Perl for Haiku and lists known problems.
es_es: Este archivo contiene instrucciones de cómo construir Perl para Haiku y listas de problemas conocidos.

source: $success = 1, last if /$pat/;
es_es: $exito = 1, last if /$pat/;

source: See L<Devel::DProf> for more information.
es_es: Consulte L<Devel::DProf> para obtener más información.

source: or maybe even this.
es_es: o tal vez incluso así.

source: This subroutine is called as above, but the first parameter is the array reference.
es_es: Esta subrutina se llama como antes, pero el primer parámetro es la referencia al array.

source: Several memory leaks associated with variables shared between threads have been fixed.
es_es: Varias agotamientos de memoria, asociados con variables compartidas entre hilos han sido corregidos.

source: For Sun systems, SunFreeware.com provides binaries of most popular applications, including compilers and Perl.
es_es: Para sistemas Sun, SunFreeware.com proporciona binarios de las aplicaciones más populares, incluidos compiladores y los binarios de Perl.

source: last LINE if $foo;
es_es: last LINEA if $foo;

source: add -Wall in cflags when compiling with gcc to weed out dubious C practices
es_es: añadir -Wall en cflags cuando se compila con gcc para eliminar prácticas dudosas de C

source: =head2 Do one thing and do it well
es_es: =head2 Haga una cosa y hágala bien

source: This function should have been named wantlist() instead.
es_es: Esta función debería haber sido nombrada wantlist().

source: This includes C<if>, basic file reads and writes, simple regexes, etc.
es_es: Incluyen pruebas de C<if>, operaciones básicas de lectura y escritura, expresiones regulares sencillas, etc.

source: Most of the time, C<when(EXPR)> is treated as an implicit smart match of C<$_>, i.e. C<$_ ~~ EXPR>.
es_es: En la mayor parte de los casos, C<when(EXPR)> es tratado como una coincidencia inteligente implícita de C<$_>, es decir, C<$_ ~~ EXPR>.

source: # same thing, but less efficient
es_es: # lo mismo, pero menos eficiente

source: We'll assume an @AoA variable as before.
es_es: Vamos a suponer una variable @AoA, como antes.

source: from sort";
es_es: desde sort";

source: =item g and c X</g> X</c>
es_es: =item g y c X</g> X</c>

source: =head2 The C<...> operator
es_es: =head2 El operador C<...>
